renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_comm_uart_aws/r_aws_cellular_comm_uart.c
/*
 * Amazon FreeRTOS CELLULAR Preview Release
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/* The config header is always included first. */

/* Standard includes. */
#include <string.h>

#include "FreeRTOS.h"
#include "event_groups.h"
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
#include "platform.h"
#endif

#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#include "rl78_bsp_wrapper.h"
#include "r_sci_rl_config.h"
#else
#include "r_sci_rx_pinset.h"
#endif

/* Cellular includes. */
#include "r_aws_cellular_if.h"


#define AWS_CELLULAR_DEFAULT_SEND_WAIT      (1)
#define AWS_CELLULAR_DEFAULT_RECV_WAIT      (1)
#define AWS_CELLULAR_RECV_LIMIT             (50)

#define AWS_CELLUALR_COMM_EVT_RX_DATA       (0x01u << 0)
#define AWS_CELLUALR_COMM_EVT_RX_ERROR      (0x01u << 1)
#define AWS_CELLUALR_COMM_EVT_RX_ABORTED    (0x01u << 2)
#define AWS_CELLUALR_COMM_EVT_TX_DONE       (0x01u << 3)
#define AWS_CELLUALR_COMM_EVT_TX_ERROR      (0x01u << 4)
#define AWS_CELLUALR_COMM_EVT_TX_ABORTED    (0x01u << 5)

#ifndef AWS_CELLULAR_CFG_SCI_CH
#error "Error! Need to define AWS_CELLULAR_CFG_SCI_CH in r_aws_cellular_config.h"
#elif AWS_CELLULAR_CFG_SCI_CH == (0)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI0())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH0)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH0_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH0_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (1)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI1())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH1)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH1_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH1_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (2)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI2())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH2)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH2_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH2_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (3)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI3())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH3)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH3_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH3_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (4)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI4())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH4)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH4_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH4_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (5)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI5())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH5)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH5_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH5_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (6)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI6())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH6)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH6_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH6_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (7)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI7())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH7)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH7_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH7_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (8)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI8())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH8)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH8_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH8_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (9)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI9())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH9)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH9_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH9_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (10)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI10())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH10)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH10_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH10_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (11)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI11())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH11)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH11_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH11_RX_BUFSIZ)
#elif AWS_CELLULAR_CFG_SCI_CH == (12)
/*  */
#define AWS_CELLULAR_SERIAL_PINSET()    (R_SCI_PinSet_SCI12())
#define AWS_CELLULAR_SERIAL_CH          (SCI_CH12)
#define AWS_CELLULAR_TX_BUFSIZE         (SCI_CFG_CH12_TX_BUFSIZ)
#define AWS_CELLULAR_RX_BUFSIZE         (SCI_CFG_CH12_RX_BUFSIZ)
#else
#error "Error! Invalid setting for AWS_CELLULAR_CFG_SCI_CH in r_aws_cellular_config.h"
#endif /* AWS_CELLULAR_CFG_SCI_CH */

