renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_comm_uart_aws/r_aws_cellular_comm_uart.c
typedef struct aws_cellular_uart_ctrl
{
    volatile uint8_t    rx_fifo_reading_flg;
    uint32_t            tx_buff_size;
    uint32_t            rx_buff_size;
    bool                if_open;
    sci_cb_evt_t        sci_err_flg;
    sci_hdl_t           sci_hdl;
    EventGroupHandle_t  p_event_hdl;
    void *              p_user_data;
    CellularCommInterfaceReceiveCallback_t p_recv_cb;
} st_aws_cellular_uart_ctrl_t;

/*-----------------------------------------------------------*/

static sci_err_t aws_cellular_serial_open (st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl);
static sci_err_t aws_cellular_serial_close (st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl);
static void      aws_cellular_uart_callback (void * const p_Args);

static CellularCommInterfaceError_t aws_cellular_open (CellularCommInterfaceReceiveCallback_t receiveCallback,
                                                       void * p_user_data,
                                                       CellularCommInterfaceHandle_t * pCommInterfaceHandle);
static CellularCommInterfaceError_t aws_cellular_close (CellularCommInterfaceHandle_t commInterfaceHandle);
static CellularCommInterfaceError_t aws_cellular_recv (CellularCommInterfaceHandle_t commInterfaceHandle,
                                                        uint8_t * pBuffer,
                                                        uint32_t bufferLength,
                                                        uint32_t timeoutMilliseconds,
                                                        uint32_t * pDataReceivedLength);
static CellularCommInterfaceError_t aws_cellular_send (CellularCommInterfaceHandle_t commInterfaceHandle,
                                                       const uint8_t * pData,
                                                       uint32_t dataLength,
                                                       uint32_t timeoutMilliseconds,
                                                       uint32_t * pDataSentLength);
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#else
static uint32_t                     aws_cellular_timeout_reconfig (st_aws_cellular_timeout_ctrl_t * const p_timeout);
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
static CellularCommInterfaceError_t aws_cellular_wait_bits (EventGroupHandle_t hdl, uint32_t timeout);
#endif
#endif

/*-----------------------------------------------------------*/

static st_aws_cellular_uart_ctrl_t s_aws_cellular_uart_ctrl = {0};

CellularCommInterface_t g_cellular_comm_interface =
{
    .open = aws_cellular_open,
    .send = aws_cellular_send,
    .recv = aws_cellular_recv,
    .close = aws_cellular_close
};

/*-----------------------------------------------------------*/

/************************************************************************
 * Function Name  @fn            aws_cellular_uart_callback
 ***********************************************************************/
static void aws_cellular_uart_callback(void * const p_Args)
{
    sci_cb_args_t * const p_args                   = (sci_cb_args_t *)p_Args; //cast
    BaseType_t            xHigherPriorityTaskWoken = pdFALSE;

    st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl = &s_aws_cellular_uart_ctrl;
    CellularCommInterfaceError_t  ret                      = IOT_COMM_INTERFACE_SUCCESS;

    switch (p_args->event)
    {
        case SCI_EVT_RX_CHAR:
        {
            if (0 == p_aws_cellular_uart_ctrl->rx_fifo_reading_flg)
            {
                ret = p_aws_cellular_uart_ctrl->p_recv_cb(p_aws_cellular_uart_ctrl->p_user_data,
                            (CellularCommInterfaceHandle_t)p_aws_cellular_uart_ctrl);
                if (IOT_COMM_INTERFACE_SUCCESS == ret)
                {
                    portYIELD_FROM_ISR(pdTRUE);
                }
            }

            xEventGroupSetBitsFromISR( p_aws_cellular_uart_ctrl->p_event_hdl,
                                       AWS_CELLUALR_COMM_EVT_RX_DATA,
                                       & xHigherPriorityTaskWoken );
            if (pdTRUE == xHigherPriorityTaskWoken)
            {
                portYIELD_FROM_ISR(pdTRUE);
            }
            break;
        }
#if SCI_CFG_TEI_INCLUDED == 1
        case SCI_EVT_TEI:
        {
            xEventGroupSetBitsFromISR(p_aws_cellular_uart_ctrl->p_event_hdl,
                                      AWS_CELLUALR_COMM_EVT_TX_DONE,
                                      &xHigherPriorityTaskWoken);
            if (pdTRUE == xHigherPriorityTaskWoken)
            {
                portYIELD_FROM_ISR(pdTRUE);
            }
            break;
        }
#endif
        case SCI_EVT_RXBUF_OVFL:
        {
            p_aws_cellular_uart_ctrl->sci_err_flg = SCI_EVT_RXBUF_OVFL;
            break;
        }
        case SCI_EVT_OVFL_ERR:
        {
            p_aws_cellular_uart_ctrl->sci_err_flg = SCI_EVT_OVFL_ERR;
            break;
        }
        case SCI_EVT_FRAMING_ERR:
        {
            p_aws_cellular_uart_ctrl->sci_err_flg = SCI_EVT_FRAMING_ERR;
            break;
        }
        case SCI_EVT_PARITY_ERR:
        {
            p_aws_cellular_uart_ctrl->sci_err_flg = SCI_EVT_PARITY_ERR;
            break;
        }
        default:
        {
            break;
        }
    }
}
/***********************************************************************
 * End of function aws_cellular_uart_callback
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_serial_open
 ***********************************************************************/
static sci_err_t aws_cellular_serial_open(st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl)
{
    sci_err_t   sci_ret     = SCI_SUCCESS;
    sci_cfg_t   sci_cfg     = {0};
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#else
    uint8_t     tx_priority = AWS_CELLULAR_CFG_SCI_PRIORITY - 1;
#endif

