renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_comm_uart_aws/r_aws_cellular_comm_uart.c
    p_aws_cellular_uart_ctrl->tx_buff_size = AWS_CELLULAR_TX_BUFSIZE;
    p_aws_cellular_uart_ctrl->rx_buff_size = AWS_CELLULAR_RX_BUFSIZE;
    sci_cfg.async.baud_rate                = AWS_CELLULAR_CFG_BAUDRATE;
    sci_cfg.async.clk_src                  = SCI_CLK_INT;
    sci_cfg.async.data_size                = SCI_DATA_8BIT;
    sci_cfg.async.parity_en                = SCI_PARITY_OFF;
    sci_cfg.async.parity_type              = SCI_EVEN_PARITY;
    sci_cfg.async.stop_bits                = SCI_STOPBITS_1;
    sci_cfg.async.int_priority             = AWS_CELLULAR_CFG_SCI_PRIORITY;    // 1=lowest, 15=highest

    sci_ret = R_SCI_Open(AWS_CELLULAR_SERIAL_CH, SCI_MODE_ASYNC, &sci_cfg,
                         aws_cellular_uart_callback, &p_aws_cellular_uart_ctrl->sci_hdl);

#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#else
    if (SCI_SUCCESS == sci_ret)
    {
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 0
        R_SCI_Control(p_aws_cellular_uart_ctrl->sci_hdl, SCI_CMD_EN_CTS_IN, FIT_NO_PTR);
#endif
#if AWS_CELLULAR_CFG_START_BIT_EDGE == 1
        R_SCI_Control(p_aws_cellular_uart_ctrl->sci_hdl, SCI_CMD_START_BIT_EDGE, FIT_NO_PTR);
#endif
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
        R_SCI_Control(p_aws_cellular_uart_ctrl->sci_hdl, SCI_CMD_SET_TXI_PRIORITY, &tx_priority);
#else
#error  BUILD_TIME_ERROR_MESSAGE_MCU_NOT_SUPPORT
#endif
        AWS_CELLULAR_SERIAL_PINSET();
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 0
        AWS_CELLULAR_SET_PODR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN) = 0;
        AWS_CELLULAR_SET_PDR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN)  = 1;
#endif
        LogInfo(("R_SCI_Open successfully. Baud rate is %d.", AWS_CELLULAR_CFG_BAUDRATE));
    }
#endif

    return sci_ret;
}
/***********************************************************************
 * End of function aws_cellular_serial_open
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_serial_reopen
 ***********************************************************************/
sci_err_t aws_cellular_serial_reopen(CellularHandle_t cellularHandle, const uint32_t baudrate)
{
    CellularContext_t           * p_context   = (CellularContext_t *) cellularHandle;                       //cast
    st_aws_cellular_uart_ctrl_t * p_uart_ctrl = (st_aws_cellular_uart_ctrl_t *)p_context->hPktioCommIntf;   //cast

    sci_err_t   sci_ret     = SCI_SUCCESS;
    sci_cfg_t   sci_cfg     = {0};
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#else
    uint8_t     tx_priority = AWS_CELLULAR_CFG_SCI_PRIORITY - 1;
#endif

    sci_cfg.async.baud_rate                = baudrate;
    sci_cfg.async.clk_src                  = SCI_CLK_INT;
    sci_cfg.async.data_size                = SCI_DATA_8BIT;
    sci_cfg.async.parity_en                = SCI_PARITY_OFF;
    sci_cfg.async.parity_type              = SCI_EVEN_PARITY;
    sci_cfg.async.stop_bits                = SCI_STOPBITS_1;
    sci_cfg.async.int_priority             = AWS_CELLULAR_CFG_SCI_PRIORITY;    // 1=lowest, 15=highest

    sci_ret = R_SCI_Open(AWS_CELLULAR_SERIAL_CH, SCI_MODE_ASYNC, &sci_cfg,
                         aws_cellular_uart_callback, &p_uart_ctrl->sci_hdl);

#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#else
    if (SCI_SUCCESS == sci_ret)
    {
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 0
        R_SCI_Control(p_uart_ctrl->sci_hdl, SCI_CMD_EN_CTS_IN, FIT_NO_PTR);
#endif
#if AWS_CELLULAR_CFG_START_BIT_EDGE == 1
        R_SCI_Control(p_uart_ctrl->sci_hdl, SCI_CMD_START_BIT_EDGE, FIT_NO_PTR);
#endif
#if defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__)
        R_SCI_Control(p_uart_ctrl->sci_hdl, SCI_CMD_SET_TXI_PRIORITY, &tx_priority);
#else
#error  BUILD_TIME_ERROR_MESSAGE_MCU_NOT_SUPPORT
#endif
        AWS_CELLULAR_SERIAL_PINSET();
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 0
        AWS_CELLULAR_SET_PODR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN) = 0;
        AWS_CELLULAR_SET_PDR(AWS_CELLULAR_CFG_RTS_PORT, AWS_CELLULAR_CFG_RTS_PIN)  = 1;
#endif
        LogInfo(("R_SCI_Open successfully. Baud rate is %d.", baudrate));
    }
#endif

    return sci_ret;
}
/***********************************************************************
 * End of function aws_cellular_serial_reopen
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_temp_close
 ***********************************************************************/
sci_err_t aws_cellular_temp_close(CellularHandle_t cellularHandle)
{
    CellularContext_t           * p_context   = (CellularContext_t *) cellularHandle;                       //cast
    st_aws_cellular_uart_ctrl_t * p_uart_ctrl = (st_aws_cellular_uart_ctrl_t *)p_context->hPktioCommIntf;   //cast

    sci_err_t ret;

    ret = R_SCI_Close(p_uart_ctrl->sci_hdl);

    return ret;
}
/***********************************************************************
 * End of function aws_cellular_temp_close
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_serial_close
 ***********************************************************************/
static sci_err_t aws_cellular_serial_close(st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl)
{
    sci_err_t ret;

    ret = R_SCI_Close(p_aws_cellular_uart_ctrl->sci_hdl);

    return ret;
}
/***********************************************************************
 * End of function aws_cellular_serial_close
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_open
 ***********************************************************************/
static CellularCommInterfaceError_t aws_cellular_open(CellularCommInterfaceReceiveCallback_t receiveCallback,
                                                       void * p_user_data,
                                                       CellularCommInterfaceHandle_t * pCommInterfaceHandle)
{
    st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl = &s_aws_cellular_uart_ctrl;

