renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_comm_uart_aws/r_aws_cellular_comm_uart.c
    sci_err_t                    sci_ret;
    CellularCommInterfaceError_t ret = IOT_COMM_INTERFACE_SUCCESS;

    /* check input parameter. */
    if ((NULL == pCommInterfaceHandle) || (NULL == receiveCallback))
    {
        ret = IOT_COMM_INTERFACE_BAD_PARAMETER;
    }
    else if (true == p_aws_cellular_uart_ctrl->if_open)
    {
        ret = IOT_COMM_INTERFACE_FAILURE;
    }
    else
    {
        /* Initialize the context structure. */
        (void)memset(p_aws_cellular_uart_ctrl, 0, sizeof(st_aws_cellular_uart_ctrl_t));
    }

    /* Setup the read FIFO. */
    if (IOT_COMM_INTERFACE_SUCCESS == ret)
    {
        p_aws_cellular_uart_ctrl->p_event_hdl = xEventGroupCreate();
        if (NULL == p_aws_cellular_uart_ctrl->p_event_hdl)
        {
            LogError(("EventGroup create failed"));
            ret = IOT_COMM_INTERFACE_NO_MEMORY;
        }
    }

    if (IOT_COMM_INTERFACE_SUCCESS == ret)
    {
        sci_ret = aws_cellular_serial_open(p_aws_cellular_uart_ctrl);
        if (SCI_SUCCESS != sci_ret)
        {
            ret     = IOT_COMM_INTERFACE_DRIVER_ERROR;
            sci_ret = aws_cellular_serial_close(p_aws_cellular_uart_ctrl);
            vEventGroupDelete(p_aws_cellular_uart_ctrl->p_event_hdl);
        }
    }

    /* setup callback function and userdata. */
    if (IOT_COMM_INTERFACE_SUCCESS == ret)
    {
        p_aws_cellular_uart_ctrl->p_recv_cb   = receiveCallback;
        p_aws_cellular_uart_ctrl->p_user_data = p_user_data;
        *pCommInterfaceHandle                 = (CellularCommInterfaceHandle_t)p_aws_cellular_uart_ctrl;
        p_aws_cellular_uart_ctrl->if_open     = true;
    }

    return ret;
}
/***********************************************************************
 * End of function aws_cellular_open
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_close
 ***********************************************************************/
static CellularCommInterfaceError_t aws_cellular_close(CellularCommInterfaceHandle_t commInterfaceHandle)
{
    st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl = (st_aws_cellular_uart_ctrl_t *)commInterfaceHandle;    //cast

    CellularCommInterfaceError_t ret = IOT_COMM_INTERFACE_FAILURE;

    if (NULL == p_aws_cellular_uart_ctrl)
    {
        ret = IOT_COMM_INTERFACE_BAD_PARAMETER;
    }
    else if (false == p_aws_cellular_uart_ctrl->if_open)
    {
        ret = IOT_COMM_INTERFACE_FAILURE;
    }
    else
    {
        if (NULL != p_aws_cellular_uart_ctrl->sci_hdl)
        {
            aws_cellular_serial_close(p_aws_cellular_uart_ctrl);
            p_aws_cellular_uart_ctrl->sci_hdl = NULL;
        }

        /* Clean event group. */
        if (NULL != p_aws_cellular_uart_ctrl->p_event_hdl)
        {
            vEventGroupDelete(p_aws_cellular_uart_ctrl->p_event_hdl);
            p_aws_cellular_uart_ctrl->p_event_hdl = NULL;
        }

        /* Set the device open status to false. */
        p_aws_cellular_uart_ctrl->if_open = false;

        ret = IOT_COMM_INTERFACE_SUCCESS;
    }

    return ret;
}
/***********************************************************************
 * End of function aws_cellular_close
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_send
 ***********************************************************************/
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
static CellularCommInterfaceError_t aws_cellular_send(CellularCommInterfaceHandle_t commInterfaceHandle,
                                                      const uint8_t * pData,
                                                      uint32_t dataLength,
                                                      uint32_t timeoutMilliseconds,
                                                      uint32_t * pDataSentLength)
{
    st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl = (st_aws_cellular_uart_ctrl_t *)commInterfaceHandle;    //cast

    CellularCommInterfaceError_t ret = IOT_COMM_INTERFACE_SUCCESS;
    sci_err_t                    err    = SCI_SUCCESS;
    EventBits_t                  uxBits = 0;
    uint32_t                     send_length;
    uint32_t                     tick_sta;
    uint32_t                     tick_timeout;
    uint32_t                     tick_tmp;

    (*pDataSentLength) = 0;
    tick_timeout = pdMS_TO_TICKS(timeoutMilliseconds);
    tick_sta  = pdMS_TO_TICKS(xTaskGetTickCount());

    if ((NULL == p_aws_cellular_uart_ctrl) || (NULL == pData) || (NULL == pDataSentLength) || (0 == dataLength))
    {
        ret = IOT_COMM_INTERFACE_BAD_PARAMETER;
    }
    else
    {
        if (false == p_aws_cellular_uart_ctrl->if_open)
        {
            ret = IOT_COMM_INTERFACE_FAILURE;
        }
    }

    if (IOT_COMM_INTERFACE_SUCCESS == ret)
    {
        while ((*pDataSentLength) < dataLength)
        {
            ( void ) xEventGroupClearBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                           AWS_CELLUALR_COMM_EVT_TX_DONE |
                                           AWS_CELLUALR_COMM_EVT_TX_ERROR |
                                           AWS_CELLUALR_COMM_EVT_TX_ABORTED);

            /* Calculate Send length */
            if ((dataLength - (*pDataSentLength)) > p_aws_cellular_uart_ctrl->tx_buff_size)
            {
                send_length = p_aws_cellular_uart_ctrl->tx_buff_size;
            }
            else
            {
                send_length = dataLength - (*pDataSentLength);
            }

            /* Send data */
            err = R_SCI_Send(p_aws_cellular_uart_ctrl->sci_hdl, (uint8_t __far *)pData + (*pDataSentLength), send_length);
            if (SCI_SUCCESS != err)
            {
                ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
                break;
            }

            /* Wait for transmit end */
            uxBits = xEventGroupWaitBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                          AWS_CELLUALR_COMM_EVT_TX_DONE |
                                          AWS_CELLUALR_COMM_EVT_TX_ERROR |
                                          AWS_CELLUALR_COMM_EVT_TX_ABORTED,
                                          pdTRUE,
                                          pdFALSE,
                                          pdMS_TO_TICKS(timeoutMilliseconds));

            /* No events? */
            if (0U == uxBits)
            {
                ret = IOT_COMM_INTERFACE_TIMEOUT;
                break;
            }

