renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_comm_uart_aws/r_aws_cellular_comm_uart.c
            /* Error events? */
            if (0U != (uxBits & (AWS_CELLUALR_COMM_EVT_TX_ERROR | AWS_CELLUALR_COMM_EVT_TX_ABORTED)))
            {
                ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
                break;
            }

            (*pDataSentLength) += send_length;

            /* timeout? */
            if (0 < timeoutMilliseconds)
            {
                tick_tmp = pdMS_TO_TICKS(xTaskGetTickCount()) - tick_sta;
                if (tick_timeout <= tick_tmp)
                {
                    ret = IOT_COMM_INTERFACE_TIMEOUT;
                    break;
                }
            }
        }
    }

    return ret;
}
#else
static CellularCommInterfaceError_t aws_cellular_send(CellularCommInterfaceHandle_t commInterfaceHandle,
                                                       const uint8_t * pData,
                                                       uint32_t dataLength,
                                                       uint32_t timeoutMilliseconds,
                                                       uint32_t * pDataSentLength)
{
    st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl = (st_aws_cellular_uart_ctrl_t *)commInterfaceHandle;    //cast

    CellularCommInterfaceError_t ret    = IOT_COMM_INTERFACE_SUCCESS;
    sci_err_t                    err    = SCI_SUCCESS;
    EventBits_t                  uxBits = 0;
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
    st_aws_cellular_timeout_ctrl_t timeout;

    uint32_t send_size  = 0;
    uint32_t waitTimeMs = timeoutMilliseconds;

    timeout.over_flg    = 0;
    timeout.timeout_flg = 0;
    timeout.start_time  = pdMS_TO_TICKS(xTaskGetTickCount());
    timeout.end_time    = timeout.start_time + timeoutMilliseconds;

    if (timeout.end_time < timeout.start_time)
    {
        timeout.over_flg = 1;
    }
#endif

    if ((NULL == p_aws_cellular_uart_ctrl) || (NULL == pData) || (NULL == pDataSentLength) || (0 == dataLength))
    {
        ret = IOT_COMM_INTERFACE_BAD_PARAMETER;
    }
    else
    {
        if (false == p_aws_cellular_uart_ctrl->if_open)
        {
            ret = IOT_COMM_INTERFACE_FAILURE;
        }
    }

    if (IOT_COMM_INTERFACE_SUCCESS == ret)
    {
#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 0
        ( void ) xEventGroupClearBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                        AWS_CELLUALR_COMM_EVT_TX_DONE |
                                        AWS_CELLUALR_COMM_EVT_TX_ERROR |
                                        AWS_CELLUALR_COMM_EVT_TX_ABORTED);

        err = R_SCI_Send(p_aws_cellular_uart_ctrl->sci_hdl, (uint8_t *)pData, (uint16_t)dataLength);    //cast
        if (SCI_SUCCESS == err)
        {
            uxBits = xEventGroupWaitBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                            AWS_CELLUALR_COMM_EVT_TX_DONE |
                                            AWS_CELLUALR_COMM_EVT_TX_ERROR |
                                            AWS_CELLUALR_COMM_EVT_TX_ABORTED,
                                            pdTRUE,
                                            pdFALSE,
                                            pdMS_TO_TICKS(timeoutMilliseconds));

            if (0U != (uxBits & (AWS_CELLUALR_COMM_EVT_TX_ERROR | AWS_CELLUALR_COMM_EVT_TX_ABORTED)))
            {
                ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
            }
            else if (0 == (uxBits & AWS_CELLUALR_COMM_EVT_TX_DONE))
            {
                ret = IOT_COMM_INTERFACE_TIMEOUT;
            }
            else
            {
                (*pDataSentLength) += dataLength;
                ret                 = IOT_COMM_INTERFACE_SUCCESS;
            }
        }
        else
        {
            ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
        }
#else /* AWS_CELLULAR_CFG_CTS_SW_CTRL == 0 */

        /* WAIT_LOOP */
        while (send_size < dataLength)
        {
            if (1 != AWS_CELLULAR_GET_PIDR(AWS_CELLULAR_CFG_CTS_PORT, AWS_CELLULAR_CFG_CTS_PIN))
            {
                (void)xEventGroupClearBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                            AWS_CELLUALR_COMM_EVT_TX_DONE |
                                            AWS_CELLUALR_COMM_EVT_TX_ERROR |
                                            AWS_CELLUALR_COMM_EVT_TX_ABORTED);

                err = R_SCI_Send(p_aws_cellular_uart_ctrl->sci_hdl, (uint8_t *)&pData[send_size], 1);    //cast
                if (SCI_SUCCESS == err)
                {
                    ret = aws_cellular_wait_bits(p_aws_cellular_uart_ctrl->p_event_hdl, waitTimeMs);
                    if (IOT_COMM_INTERFACE_SUCCESS == ret)
                    {
                        send_size++;
                    }
                    else
                    {
                        break;
                    }
                }
                else
                {
                    ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
                    break;
                }
            }

            waitTimeMs = aws_cellular_timeout_reconfig(&timeout);
            if (1 == timeout.timeout_flg)
            {
                ret = IOT_COMM_INTERFACE_TIMEOUT;
                break;
            }
        }

        *pDataSentLength = send_size;
#endif  /* AWS_CELLULAR_CFG_CTS_SW_CTRL == 0 */
    }

    return ret;
}
#endif /* defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL) */
/***********************************************************************
 * End of function aws_cellular_send
 **********************************************************************/

/************************************************************************
 * Function Name  @fn            aws_cellular_recv
 ***********************************************************************/
#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
static CellularCommInterfaceError_t aws_cellular_recv(CellularCommInterfaceHandle_t commInterfaceHandle,
                                                      uint8_t * pBuffer,
                                                      uint32_t bufferLength,
                                                      uint32_t timeoutMilliseconds,
                                                      uint32_t * pDataReceivedLength)
{
    st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl = (st_aws_cellular_uart_ctrl_t *)commInterfaceHandle;    //cast

