renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_comm_uart_aws/r_aws_cellular_comm_uart.c
    CellularCommInterfaceError_t ret = IOT_COMM_INTERFACE_SUCCESS;

    EventBits_t uxBits       = 0;
    sci_err_t   sci_ret      = SCI_SUCCESS;
    uint8_t     rxChar       = 0;
    uint32_t    rxCount      = 0;
    uint32_t    wait_timems  = AWS_CELLULAR_DEFAULT_RECV_WAIT;
    uint32_t    tick_sta;
    uint32_t    tick_timeout;
    uint32_t    tick_tmp;

    (*pDataReceivedLength) = 0;
    tick_timeout = pdMS_TO_TICKS(timeoutMilliseconds);
    tick_sta  = pdMS_TO_TICKS(xTaskGetTickCount());

    if ((NULL == p_aws_cellular_uart_ctrl) || (NULL == pBuffer) ||
            (NULL == pDataReceivedLength) || (0 == bufferLength))
    {
        ret = IOT_COMM_INTERFACE_BAD_PARAMETER;
    }
    else if (false == p_aws_cellular_uart_ctrl->if_open)
    {
        ret = IOT_COMM_INTERFACE_FAILURE;
    }
    else
    {
        /* Set this flag to inform interrupt handler to stop calling callback function. */
        p_aws_cellular_uart_ctrl->rx_fifo_reading_flg = 1U;

        ( void ) xEventGroupClearBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                        AWS_CELLUALR_COMM_EVT_RX_DATA |
                                        AWS_CELLUALR_COMM_EVT_RX_ERROR |
                                        AWS_CELLUALR_COMM_EVT_RX_ABORTED);

        /* WAIT_LOOP */
        while (rxCount < bufferLength)
        {
            sci_ret = R_SCI_Receive(p_aws_cellular_uart_ctrl->sci_hdl, &rxChar, 1);
            if (SCI_SUCCESS == sci_ret)
            {
                pBuffer[rxCount] = rxChar;
                rxCount++;

                if (((' ' == rxChar) && ('>' == pBuffer[rxCount - 2])) ||
                        ((rxCount > 2) && ('\n' == rxChar)))
                {
                    break;
                }
            }
            else
            {
                uxBits = xEventGroupWaitBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                                AWS_CELLUALR_COMM_EVT_RX_DATA |
                                                AWS_CELLUALR_COMM_EVT_RX_ERROR |
                                                AWS_CELLUALR_COMM_EVT_RX_ABORTED,
                                                pdTRUE,
                                                pdFALSE,
                                                pdMS_TO_TICKS(wait_timems));  //cast

                if (0U != (uxBits & (AWS_CELLUALR_COMM_EVT_RX_ERROR | AWS_CELLUALR_COMM_EVT_RX_ABORTED)))
                {
                    ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
                    break;
                }
            }

            /* timeout? */
            if (0 < timeoutMilliseconds)
            {
                tick_tmp = pdMS_TO_TICKS(xTaskGetTickCount()) - tick_sta;
                if (tick_timeout <= tick_tmp)
                {
                    ret = IOT_COMM_INTERFACE_TIMEOUT;
                    break;
                }
            }
        }

        /* Clear this flag to inform interrupt handler to call callback function. */
        p_aws_cellular_uart_ctrl->rx_fifo_reading_flg = 0U;

        *pDataReceivedLength = rxCount;

        /* Return success if bytes received. Even if timeout or RX error. */
        if (rxCount > 0)
        {
            ret = IOT_COMM_INTERFACE_SUCCESS;
        }
    }

    return ret;
}
#else
static CellularCommInterfaceError_t aws_cellular_recv(CellularCommInterfaceHandle_t commInterfaceHandle,
                                                      uint8_t * pBuffer,
                                                      uint32_t bufferLength,
                                                      uint32_t timeoutMilliseconds,
                                                      uint32_t * pDataReceivedLength)
{
    st_aws_cellular_uart_ctrl_t * p_aws_cellular_uart_ctrl = (st_aws_cellular_uart_ctrl_t *)commInterfaceHandle;    //cast

    CellularCommInterfaceError_t ret = IOT_COMM_INTERFACE_SUCCESS;

    EventBits_t uxBits       = 0;
    sci_err_t   sci_ret      = SCI_SUCCESS;
    uint8_t     err_count    = 0;
    uint8_t     rxChar       = 0;
    uint32_t    rxCount      = 0;
    uint32_t    remainTimeMs = timeoutMilliseconds;
    uint32_t    wait_timems  = AWS_CELLULAR_DEFAULT_RECV_WAIT;

    st_aws_cellular_timeout_ctrl_t timeout;

    timeout.over_flg    = 0;
    timeout.timeout_flg = 0;
    timeout.start_time  = pdMS_TO_TICKS(xTaskGetTickCount());
    timeout.end_time    = timeout.start_time + timeoutMilliseconds;

    if (timeout.end_time < timeout.start_time)
    {
        timeout.over_flg = 1;
    }

    if ((NULL == p_aws_cellular_uart_ctrl) || (NULL == pBuffer) ||
            (NULL == pDataReceivedLength) || (0 == bufferLength))
    {
        ret = IOT_COMM_INTERFACE_BAD_PARAMETER;
    }
    else if (false == p_aws_cellular_uart_ctrl->if_open)
    {
        ret = IOT_COMM_INTERFACE_FAILURE;
    }
    else
    {
        /* Set this flag to inform interrupt handler to stop callling callback function. */
        p_aws_cellular_uart_ctrl->rx_fifo_reading_flg = 1U;

        ( void ) xEventGroupClearBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                        AWS_CELLUALR_COMM_EVT_RX_DATA |
                                        AWS_CELLUALR_COMM_EVT_RX_ERROR |
                                        AWS_CELLUALR_COMM_EVT_RX_ABORTED);

        /* WAIT_LOOP */
        while (rxCount < bufferLength)
        {
            sci_ret = R_SCI_Receive(p_aws_cellular_uart_ctrl->sci_hdl, &rxChar, 1);
            if (SCI_SUCCESS == sci_ret)
            {
                pBuffer[rxCount] = rxChar;
                rxCount++;

                if (((' ' == rxChar) && ('>' == pBuffer[rxCount - 2])) ||
                        ((rxCount > 2) && ('\n' == rxChar)))
                {
                    break;
                }
            }
            else
            {
                err_count++;
                if (err_count >= AWS_CELLULAR_RECV_LIMIT)
                {
                    break;
                }

                if (rxCount > 0)
                {
                    wait_timems = remainTimeMs;
                }
                else
                {
                    wait_timems = AWS_CELLULAR_DEFAULT_RECV_WAIT;
                }

                uxBits = xEventGroupWaitBits(p_aws_cellular_uart_ctrl->p_event_hdl,
                                                AWS_CELLUALR_COMM_EVT_RX_DATA |
                                                AWS_CELLUALR_COMM_EVT_RX_ERROR |
                                                AWS_CELLUALR_COMM_EVT_RX_ABORTED,
                                                pdTRUE,
                                                pdFALSE,
                                                pdMS_TO_TICKS(wait_timems));  //cast

