renesas/iot-reference-rl78/Projects/rl78g23-fpb/modules/r_aws_cellular_lib/src/cellular_comm_uart_aws/r_aws_cellular_comm_uart.c
                if (0U != (uxBits & (AWS_CELLUALR_COMM_EVT_RX_ERROR | AWS_CELLUALR_COMM_EVT_RX_ABORTED)))
                {
                    ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
                    break;
                }

                remainTimeMs = aws_cellular_timeout_reconfig(&timeout);
                if (1 == timeout.timeout_flg)
                {
                    ret = IOT_COMM_INTERFACE_TIMEOUT;
                    break;
                }
            }
        }

        /* Clear this flag to inform interrupt handler to call callback function. */
        p_aws_cellular_uart_ctrl->rx_fifo_reading_flg = 0U;

        *pDataReceivedLength = rxCount;

        /* Return success if bytes received. Even if timeout or RX error. */
        if (rxCount > 0)
        {
            ret = IOT_COMM_INTERFACE_SUCCESS;
        }
    }

    return ret;
}
#endif /* defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL) */
/***********************************************************************
 * End of function aws_cellular_recv
 **********************************************************************/

#if defined(__CCRL__) || defined(__ICCRL78__) || defined(__RL)
#else
/************************************************************************
 * Function Name  @fn            aws_cellular_timeout_reconfig
 ***********************************************************************/
static uint32_t aws_cellular_timeout_reconfig(st_aws_cellular_timeout_ctrl_t * const p_timeout)
{
    uint32_t remain_time = 0;
    uint32_t this_time   = pdMS_TO_TICKS(xTaskGetTickCount());

    if (0 == p_timeout->over_flg)
    {
        if ((this_time >= p_timeout->end_time) || (this_time < p_timeout->start_time))
        {
            p_timeout->timeout_flg = 1;
        }
        else
        {
            remain_time = p_timeout->end_time - this_time;
        }
    }
    else
    {
        if ((this_time < p_timeout->start_time) && (this_time >= p_timeout->end_time))
        {
            p_timeout->timeout_flg = 1;
        }
        else
        {
            if (this_time < p_timeout->start_time)
            {
                remain_time = p_timeout->end_time - this_time;
            }
            else
            {
                remain_time = p_timeout->end_time + (portMAX_DELAY - this_time);
            }
        }
    }

    return remain_time;
}
/***********************************************************************
 * End of function aws_cellular_timeout_reconfig
 **********************************************************************/

#if AWS_CELLULAR_CFG_CTS_SW_CTRL == 1
/************************************************************************
 * Function Name  @fn            aws_cellular_wait_bits
 ***********************************************************************/
static CellularCommInterfaceError_t aws_cellular_wait_bits(EventGroupHandle_t hdl, uint32_t timeout)
{
    EventBits_t                  bits;
    CellularCommInterfaceError_t ret = IOT_COMM_INTERFACE_SUCCESS;

    bits = xEventGroupWaitBits(hdl,
                              AWS_CELLUALR_COMM_EVT_TX_DONE |
                              AWS_CELLUALR_COMM_EVT_TX_ERROR |
                              AWS_CELLUALR_COMM_EVT_TX_ABORTED,
                              pdTRUE,
                              pdFALSE,
                              pdMS_TO_TICKS(timeout));  //cast

    if (0U != (bits & (AWS_CELLUALR_COMM_EVT_TX_ERROR | AWS_CELLUALR_COMM_EVT_TX_ABORTED)))
    {
        ret = IOT_COMM_INTERFACE_DRIVER_ERROR;
    }
    else
    {
        if (0 == (bits & AWS_CELLUALR_COMM_EVT_TX_DONE))
        {
            ret = IOT_COMM_INTERFACE_TIMEOUT;
        }
    }

    return ret;
}
/***********************************************************************
 * End of function aws_cellular_wait_bits
 **********************************************************************/
#endif /* AWS_CELLULAR_CFG_CTS_SW_CTRL == 1 */
#endif /* defined(__CCRX__) || defined(__ICCRX__) || defined(__RX__) */
